app/controllers/cottages_controller.rb

SELECT "cottages".* FROM "cottages"
---
  def index
    @cottages = Cottage.all

SELECT "cottages".* FROM "cottages" ORDER BY "cottages"."number_of_visitor_disappearances" ASC LIMIT ?  [["LIMIT", 1]]
---
  def most_disappearances
    @cottage = Cottage.order(:number_of_visitor_disappearances).first

SELECT "cottages".* FROM "cottages" ORDER BY "cottages"."rating" ASC LIMIT ?  [["LIMIT", 1]]
---
  def highest_rated
    @cottage = Cottage.order(:rating).first

SELECT "cottages".* FROM "cottages" WHERE "cottages"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_cottage
    @cottage = Cottage.find(params[:id])